
SOURCE_MAP = {
    "yandex": (
        "Яндекс Карты",
        "Яндекс Карты",
        "5359811897677848798",  # yandex
    ),
    "yandex_browser": (
        "Яндекс Браузер",
        "Яндекс Браузер",
        "5267066657355900602",  # yandex browser
    ),
    "2gis": (
        "2ГИС",
        "2ГИС",
        "5244638999561135703",  # 2gis
    ),
    "google": (
        "Google Maps",
        "Google Maps",
        "5343611925282435092",  # google
    ),
    "vk": (
        "VK",
        "VK",
        "5263006895353896908",  # vk
    ),
    "yell": (
        "Yell",
        "Yell",
        "5264961741128769729",  # yell
    ),
    "zoon": (
        "Zoon",
        "Zoon",
        "5267443489196510893",  # zoon
    ),
}