from __future__ import annotations

import logging

from aiogram.types import CallbackQuery

from aiogram_dialog import Dialog, Window, DialogManager, StartMode
from aiogram_dialog.widgets.kbd import Button
from aiogram_dialog.widgets.text import Const

from app.bot.dialogs.states import MainMenuSG, PaymentsSG, RulesSG, ContactsSG, TasksSG

logger = logging.getLogger(__name__)


async def go_formatting(c: CallbackQuery, button: Button, manager: DialogManager):
    await manager.switch_to(RulesSG.formatting)


async def go_passability(c: CallbackQuery, button: Button, manager: DialogManager):
    await manager.switch_to(RulesSG.passability)


async def back_to_rules_menu(
    c: CallbackQuery,
    button: Button,
    manager: DialogManager,
):
    await manager.switch_to(RulesSG.main)


async def back_to_menu(
    callback: CallbackQuery,
    widget: Button,
    dialog_manager: DialogManager,
) -> None:
    """Возвращает пользователя в главное меню.

    Args:
        callback (CallbackQuery): Callback от Telegram.
        widget (Button): Нажатая кнопка.
        dialog_manager (DialogManager): Менеджер диалога.
    """
    await dialog_manager.start(MainMenuSG.main, mode=StartMode.RESET_STACK)


tasks_dialog = Dialog(
    Window(
        Const("📦 <b>Задания</b>\n\nИнформация о выплатах будет добавлена позже."),
        Button(Const("⬅️ В меню"), id="back_menu", on_click=back_to_menu),
        state=TasksSG.empty,
    ),
)


payments_dialog = Dialog(
    Window(
        Const(
            "💰 <b>Выплаты</b>\n\n"
            "📅 <b>График выплат:</b>\n"
            "Выплата производится <b>каждую пятницу</b> за неделю работы.\n\n"
            "💵 <b>Ставка:</b>\n"
            "• <b>50 ₽</b> за один отзыв.\n"
            "• Если отзыв <b>не прошёл проверку</b>, он <b>аннулируется</b> и не оплачивается.\n\n"
            "📝 <b>Примечание:</b>\n"
            "Если вы начали работу в понедельник или в середине недели,\n"
            "выплата поступит <b>в следующую пятницу</b>."
        ),
        Button(Const("⬅️ В меню"), id="back_menu", on_click=back_to_menu),
        state=PaymentsSG.main,
    ),
)




rules_dialog = Dialog(
    Window(
        Const("📜 <b>Правила</b>\n\nВыберите раздел:"),
        Button(Const("✅ Правила оформления отзыва"), id="fmt", on_click=go_formatting),
        Button(Const("📈 Проходимость отзыва"), id="pass", on_click=go_passability),
        Button(Const("⬅️ В меню"), id="back_menu", on_click=back_to_menu),
        state=RulesSG.main,
    ),
    Window(
        Const(
            "✅ <b>Правила оформления отзыва</b>\n\n"
            "1️⃣ <b>Открываем «Яндекс Карты»</b>\n"
            "Рекомендуется использовать мобильное приложение.\n"
            "<i>Допускается Safari и другие браузеры, но проходимость может снизиться.</i>\n\n"

            "2️⃣ <b>Пишем только выданный текст</b>\n"
            "Ничего не добавляем от себя и не меняем формулировки.\n\n"

            "3️⃣ <b>Соблюдаем пол и склонения</b>\n"
            "Если отзыв написан от лица девушки — используем женский аккаунт.\n"
            "Если от мужчины — мужской.\n"
            "<i>Если склонений нет — можно писать с любого аккаунта.</i>\n\n"

            "4️⃣ <b>Ставим 3–4 лайка</b>\n"
            "Лайкаем уже существующие отзывы, иначе ваш отзыв может быть аннулирован.\n\n"

            "5️⃣ <b>Добавляем фотографию</b>\n"
            "На фото обязательно должны быть видны организация и сам отзыв.\n\n"

            "6️⃣ <b>Один отзыв — один аккаунт</b>\n"
            "Запрещено оставлять более одного отзыва с одного аккаунта.\n"
            "<i>Через неделю можно выполнить новое задание на другое учреждение.</i>\n\n"

            "7️⃣ <b>Отключаем геолокацию</b>\n"
            "Перед созданием отзыва <b>обязательно отключите геолокацию</b> на устройстве.\n\n"

            "8️⃣ <b>Совершаем звонок в компанию</b>\n"
            "Перед публикацией отзыва необходимо позвонить в компанию заказчика.\n"
            "<i>Звонок должен длиться около 5 секунд — затем сбросьте вызов.</i>\n\n"

            "✨ <b>Соблюдение всех правил повышает шанс успешной модерации и оплаты.</b>"
        ),
        Button(Const("⬅️ Назад"), id="back_rules", on_click=back_to_rules_menu),
        state=RulesSG.formatting,
    ),
    Window(
        Const(
            "📈 <b>Проходимость отзыва</b>\n\n"
            "• Знаток 1 — ~60%\n"
            "• Знаток 2 — ~70%\n"
            "• Знаток 3 — ~80%\n"
            "• Знаток 4 — ~90%\n"
            "• Знаток 5 — ~100%"
        ),
        Button(Const("⬅️ Назад"), id="back_rules_2", on_click=back_to_rules_menu),
        state=RulesSG.passability,
    ),
)
contacts_dialog = Dialog(
    Window(
        Const(
            "☎️ <b>Контакты / Работа с нами</b>\n\n"
            "🏆 <b>Карта Успеха</b>\n"
            "<i>Ваша репутация - это наш проект!.</i>\n\n"
            "📞 <b>Контактный номер:</b>\n"
            "+7 (900) 264-96-63\n\n"
            "📩 <b>Почта:</b>\n"
            "kartauspeha24@mail.ru\n\n"
            "<a href=\"https://t.me/+Mk_qpz4dCzJhNjhi\">Карта Успеха в Telegram</a>\n\n"
            "🤝 <b>Сотрудничество:</b>\n"
            "Открыты к партнёрству и предложениям. Напишите нам — ответим в ближайшее время."
        ),
        Button(Const("⬅️ В меню"), id="back_menu", on_click=back_to_menu),
        state=ContactsSG.main,
    ),
)
